src/cf/Documents/уатПрочиеДоходыРасходы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>уатПрочиеДоходыРасходы</Name>
			<BasedOn>
				<xr:Item>Document.уатОтчетСистемыПлатон</xr:Item>
				<xr:Item>Document.уатПарковка</xr:Item>
				<xr:Item>Document.уатСписаниеТоваров</xr:Item>
				<xr:Item>Document.уатРемонтныйЛист</xr:Item>
				<xr:Item>Document.уатОтчетСистемыАвтодор</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.уатИзносАгрегатов</xr:Item>
				<xr:Item>AccumulationRegister.уатРасходы</xr:Item>
				<xr:Item>AccumulationRegister.уатСпецодеждаИИнструментыСотрудников</xr:Item>
				<xr:Item>AccumulationRegister.уатДоходы</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Comment>Вид операции</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.уатВидыОперацийПрочиеДоходыРасходы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Колонна</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатКолонны</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Comment>Валюта документа</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Comment>Сумма в валюте документа, налоги включены согласно флагам</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчитыватьНДС</Name>
					<Comment>Учитывать НДС</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаВключаетНДС</Name>
					<Comment>Сумма включает НДС</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Comment>Документ основание</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.уатПарковка</v8:Type>
						<v8:Type>cfg:DocumentRef.уатОтчетСистемыПлатон</v8:Type>
						<v8:Type>cfg:DocumentRef.уатРемонтныйЛист</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Расходы</Name>
					<Comment>(Общ)</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаОтражения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяРасходов</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.уатСтатьиРасходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатТС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Заказ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.уатЗаказГрузоотправителя</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Comment>Сумма в валюте регл. учета</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Comment>Ставка НДС</Comment>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Comment>Сумма НДС в валюте регл. учета</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетЗатрат</Name>
							<Comment>(Регл)</Comment>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.уатРегламентированный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НоменклатурнаяГруппа</Name>
							<Comment>(Упр)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.НоменклатурныеГруппы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъектСтроительства</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатОбъектыСтроительства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Маршрут</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатМаршруты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидПеревозки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатВидыПеревозок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаправлениеПеревозки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатНаправленияПеревозок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Агрегат</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатСерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Доходы</Name>
					<Comment>(Общ)</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаОтражения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяДоходов</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.уатСтатьиДоходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатТС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Заказ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.уатЗаказГрузоотправителя</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Comment>Сумма в валюте регл. учета</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Comment>Ставка НДС</Comment>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Comment>Сумма НДС в валюте регл. учета</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъектСтроительства</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатОбъектыСтроительства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Маршрут</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатМаршруты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидПеревозки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатВидыПеревозок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаправлениеПеревозки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатНаправленияПеревозок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/AccumulationRegisters/уатИзносАгрегатов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>уатИзносАгрегатов</Name>
			<Comment>(уат)</Comment>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Пробег</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Износ</Name>
					<Comment>Износ в валюте агрегата</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатСерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатТС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/cf/AccumulationRegisters/уатСпецодеждаИИнструментыСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>уатСпецодеждаИИнструментыСотрудников</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Стоимость</Name>
					<Comment>Первоначальная стоимость в валюте управленческого учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаИзноса</Name>
					<Comment>Сумма износа в валюте управленческого учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаВыдачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/cf/Enums/уатВидыОперацийПрочиеДоходыРасходы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>уатВидыОперацийПрочиеДоходыРасходы</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Доходы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Расходы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Documents/уатПрочиеДоходыРасходы/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
	
	Настройки.ПриПолученииСлужебныхРеквизитов = Ложь;
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

// СтандартныеПодсистемы.Печать

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	// необходима для подключения внешних ПФ
	Заглушка = Истина;
КонецПроцедуры

// Конец СтандартныеПодсистемы.Печать

// СтандартныеПодсистемы.УправлениеДоступом

// Позволяет переопределить ограничение, указанное в модуле менеджера объекта метаданных.
//
// Параметры:
//  Ограничение - Структура:
//    * Текст                             - Строка - ограничение доступа для пользователей.
//                                          Если пустая строка, значит, доступ разрешен.
//    * ТекстДляВнешнихПользователей      - Строка - ограничение доступа для внешних пользователей.
//                                          Если пустая строка, значит, доступ запрещен.
//    * ПоВладельцуБезЗаписиКлючейДоступа - Неопределено - определить автоматически.
//                                        - Булево - если Ложь, то всегда записывать ключи доступа,
//                                          если Истина, тогда не записывать ключи доступа,
//                                          а использовать ключи доступа владельца (требуется,
//                                          чтобы ограничение было строго по объекту-владельцу).
//   * ПоВладельцуБезЗаписиКлючейДоступаДляВнешнихПользователей - Неопределено, Булево - также
//                                          как у параметра ПоВладельцуБезЗаписиКлючейДоступа.
//
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)
	|	И ЗначениеРазрешено(Подразделение)";
	
	Ограничение.ТекстДляВнешнихПользователей = Ограничение.Текст;
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// СтандартныеПодсистемы.ВариантыОтчетов

// Определяет список команд отчетов.
//
// Параметры:
//   КомандыОтчетов - ТаблицаЗначений - Таблица с командами отчетов. Для изменения.
//       См. описание 1 параметра процедуры ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов().
//   Параметры - Структура - Вспомогательные параметры. Для чтения.
//       См. описание 2 параметра процедуры ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов().
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры) Экспорт
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ВариантыОтчетов

#КонецОбласти

#КонецОбласти


#Область СлужебныйПрограммныйИнтерфейс

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, СтруктураДополнительныеСвойства) Экспорт

	СформироватьТаблицаДоходыРасходы(ДокументСсылка, СтруктураДополнительныеСвойства);
	СформироватьТаблицаИзносАгрегатов(ДокументСсылка, СтруктураДополнительныеСвойства);
	СформироватьТаблицаСпецодеждаСотрудников(ДокументСсылка, СтруктураДополнительныеСвойства);
		
КонецПроцедуры // ИнициализироватьДанныеДокумента()

Процедура ВыполнитьКонтроль(ДокументСсылка, ДополнительныеСвойства, Отказ, УдалениеПроведения = Ложь) Экспорт
	
	Заголовок = уатОбщегоНазначенияТиповые.уатПредставлениеДокументаПриПроведении(ДокументСсылка);
	
	Для Каждого ТекСтрокаРасходы Из ДокументСсылка.Расходы Цикл
		//агрегат
		Если ЗначениеЗаполнено(ТекСтрокаРасходы.Агрегат) Тогда
			Запрос = Новый Запрос(
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	уатИзносАгрегатовОбороты.СерияНоменклатуры.ПервоначальнаяСтоимость - ЕСТЬNULL(уатИзносАгрегатовОбороты.ИзносОборот, 0) КАК ОстаточнаяСтоимость
			|ИЗ
			|	РегистрНакопления.уатИзносАгрегатов.Обороты(, &Период, , СерияНоменклатуры = &Агрегат) КАК уатИзносАгрегатовОбороты
			|	ГДЕ уатИзносАгрегатовОбороты.СерияНоменклатуры.ПервоначальнаяСтоимость - ЕСТЬNULL(уатИзносАгрегатовОбороты.ИзносОборот, 0) < 0");
			Запрос.УстановитьПараметр("Период",  Новый Граница(ТекСтрокаРасходы.ДатаОтражения, ВидГраницы.Включая));
			Запрос.УстановитьПараметр("Агрегат", ТекСтрокаРасходы.Агрегат);
			
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
				Если ТекСтрокаРасходы.Сумма + Выборка.ОстаточнаяСтоимость <= 0 Тогда
					ТекстНСТР = СтрШаблон(
						"Амортизация агрегата ""%1"" не требуется, его остаточная стоимость равна 0.",
						ТекСтрокаРасходы.Агрегат);	
				Иначе
					ТекстНСТР = СтрШаблон(
						"Обнаружена отрицательная остаточная стоимость агрегата ""%1"": %2. Сумма амортизации не должна превышать %3.",
						ТекСтрокаРасходы.Агрегат, Выборка.ОстаточнаяСтоимость, ТекСтрокаРасходы.Сумма + Выборка.ОстаточнаяСтоимость);	
				КонецЕсли;
				уатОбщегоНазначенияТиповые.СообщитьОбОшибке(ТекстНСТР, Отказ, Заголовок);
			КонецЕсли;
					
		//спецодежда
		ИначеЕсли ТекСтрокаРасходы.Номенклатура.ВидНоменклатуры = Справочники.ВидыНоменклатуры.СпецодеждаИИнструменты Тогда
			Запрос = Новый Запрос(
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	уатСпецодеждаИИнструментыСотрудниковОстатки.СтоимостьОстаток - уатСпецодеждаИИнструментыСотрудниковОстатки.СуммаИзносаОстаток КАК СтоимостьОстаток
			|ИЗ
			|	РегистрНакопления.уатСпецодеждаИИнструментыСотрудников.Остатки(
			|			&Период,
			|			Сотрудник = &Сотрудник
			|				И Номенклатура = &Номенклатура) КАК уатСпецодеждаИИнструментыСотрудниковОстатки
			|ГДЕ
			|	уатСпецодеждаИИнструментыСотрудниковОстатки.СтоимостьОстаток - уатСпецодеждаИИнструментыСотрудниковОстатки.СуммаИзносаОстаток < 0");
			Запрос.УстановитьПараметр("Период",       Новый Граница(ТекСтрокаРасходы.ДатаОтражения, ВидГраницы.Включая));
			Запрос.УстановитьПараметр("Сотрудник",    ТекСтрокаРасходы.Сотрудник);
			Запрос.УстановитьПараметр("Номенклатура", ТекСтрокаРасходы.Номенклатура);
			
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
				ТекстНСТР = СтрШаблон(
					"Обнаружена отрицательная остаточная стоимость спецодежды ""%1"" сотрудника ""%2"": %3. Сумма амортизации не должна превышать %4.",
					ТекСтрокаРасходы.Номенклатура, ТекСтрокаРасходы.Сотрудник, Выборка.СтоимостьОстаток,
					ТекСтрокаРасходы.Сумма + Выборка.СтоимостьОстаток);
				уатОбщегоНазначенияТиповые.СообщитьОбОшибке(ТекстНСТР, Отказ, Заголовок);
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаДоходыРасходы(ДокументСсылка, СтруктураДополнительныеСвойства)
	
	мЗапрос = Новый Запрос;
	Если ДокументСсылка.ВидОперации = Перечисления.уатВидыОперацийПрочиеДоходыРасходы.Доходы Тогда
		мЗапрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	уатПрочиеДоходыРасходы.ДатаОтражения КАК Период,
		|	уатПрочиеДоходыРасходы.Ссылка КАК Регистратор,
		|	уатПрочиеДоходыРасходы.Ссылка.Организация КАК Организация,
		|	уатПрочиеДоходыРасходы.Ссылка.Подразделение КАК Подразделение,
		|	уатПрочиеДоходыРасходы.Ссылка.Колонна КАК Колонна,
		|	уатПрочиеДоходыРасходы.ТС КАК ТС,
		|	уатПрочиеДоходыРасходы.СтатьяДоходов КАК СтатьяДоходов,
		|	уатПрочиеДоходыРасходы.Сумма КАК Сумма,
		|	уатПрочиеДоходыРасходы.Сумма КАК СуммаРегл,
		|	уатПрочиеДоходыРасходы.Сумма КАК СуммаУпр,
		|	ВЫБОР
		|		КОГДА уатПрочиеДоходыРасходы.Ссылка.УчитыватьНДС
		|			ТОГДА уатПрочиеДоходыРасходы.СуммаНДС
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СуммаНДС,
		|	ВЫБОР
		|		КОГДА уатПрочиеДоходыРасходы.Ссылка.УчитыватьНДС
		|			ТОГДА уатПрочиеДоходыРасходы.СуммаНДС
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СуммаНДСУпр,
		|	уатПрочиеДоходыРасходы.Заказ КАК Заказ,
		|	уатПрочиеДоходыРасходы.Заказ.Ответственный КАК Менеджер,
		|	уатПрочиеДоходыРасходы.Контрагент КАК Контрагент,
		|	уатПрочиеДоходыРасходы.ОбъектСтроительства КАК ОбъектСтроительства,
		|	уатПрочиеДоходыРасходы.Маршрут КАК Маршрут,
		|	уатПрочиеДоходыРасходы.ВидПеревозки КАК ВидПеревозки,
		|	уатПрочиеДоходыРасходы.НаправлениеПеревозки КАК НаправлениеПеревозки
		|ИЗ
		|	Документ.уатПрочиеДоходыРасходы.Доходы КАК уатПрочиеДоходыРасходы
		|ГДЕ
		|	уатПрочиеДоходыРасходы.Ссылка = &Ссылка";
	Иначе
		мЗапрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	уатПрочиеДоходыРасходы.ДатаОтражения КАК Период,
		|	уатПрочиеДоходыРасходы.Ссылка КАК Регистратор,
		|	уатПрочиеДоходыРасходы.Ссылка.Организация КАК Организация,
		|	уатПрочиеДоходыРасходы.Ссылка.Подразделение КАК Подразделение,
		|	уатПрочиеДоходыРасходы.Ссылка.Колонна КАК Колонна,
		|	уатПрочиеДоходыРасходы.ТС КАК ТС,
		|	уатПрочиеДоходыРасходы.СтатьяРасходов,
		|	уатПрочиеДоходыРасходы.Сумма КАК Сумма,
		|	уатПрочиеДоходыРасходы.Сумма КАК СуммаРегл,
		|	уатПрочиеДоходыРасходы.Сумма КАК СуммаУпр,
		|	ВЫБОР
		|		КОГДА уатПрочиеДоходыРасходы.Ссылка.УчитыватьНДС
		|			ТОГДА уатПрочиеДоходыРасходы.СуммаНДС
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СуммаНДС,
		|	ВЫБОР
		|		КОГДА уатПрочиеДоходыРасходы.Ссылка.УчитыватьНДС
		|			ТОГДА уатПрочиеДоходыРасходы.СуммаНДС
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СуммаНДСУпр,
		|	уатПрочиеДоходыРасходы.Заказ,
		|	уатПрочиеДоходыРасходы.Заказ.Ответственный КАК Менеджер,
		|	уатПрочиеДоходыРасходы.Контрагент КАК Контрагент,
		|	уатПрочиеДоходыРасходы.ОбъектСтроительства КАК ОбъектСтроительства,
		|	уатПрочиеДоходыРасходы.Маршрут КАК Маршрут,
		|	уатПрочиеДоходыРасходы.ВидПеревозки КАК ВидПеревозки,
		|	уатПрочиеДоходыРасходы.НаправлениеПеревозки КАК НаправлениеПеревозки
		|ИЗ
		|	Документ.уатПрочиеДоходыРасходы.Расходы КАК уатПрочиеДоходыРасходы
		|ГДЕ
		|	уатПрочиеДоходыРасходы.Ссылка = &Ссылка";
	КонецЕсли;
	
	мЗапрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	
	ТаблицаДокумента = мЗапрос.Выполнить().Выгрузить();
	
	Для Каждого ТекСтрока Из ТаблицаДокумента Цикл
		СуммаВсего = ТекСтрока.Сумма + ?(ДокументСсылка.УчитыватьНДС И НЕ ДокументСсылка.СуммаВключаетНДС, ТекСтрока.СуммаНДС, 0);		
		
		ТекСтрока.СуммаРегл   = уатОбщегоНазначенияТиповые.ПересчитатьИзВалютыВВалюту(СуммаВсего,
			ДокументСсылка.ВалютаДокумента,                     СтруктураДополнительныеСвойства.ВалютаРеглУчета,
			СтруктураДополнительныеСвойства.КурсДокумента,      СтруктураДополнительныеСвойства.КурсРегл,
			СтруктураДополнительныеСвойства.КратностьДокумента, СтруктураДополнительныеСвойства.КратностьРегл,,
			ДокументСсылка);
		ТекСтрока.СуммаУпр    = уатОбщегоНазначенияТиповые.ПересчитатьИзВалютыВВалюту(СуммаВсего,
			ДокументСсылка.ВалютаДокумента,                     СтруктураДополнительныеСвойства.ВалютаУпрУчета,
			СтруктураДополнительныеСвойства.КурсДокумента,      СтруктураДополнительныеСвойства.КурсУпр,
			СтруктураДополнительныеСвойства.КратностьДокумента, СтруктураДополнительныеСвойства.КратностьУпр,,
			ДокументСсылка);
		ТекСтрока.СуммаНДС    = уатОбщегоНазначенияТиповые.ПересчитатьИзВалютыВВалюту(ТекСтрока.СуммаНДС,
			ДокументСсылка.ВалютаДокумента,                     СтруктураДополнительныеСвойства.ВалютаРеглУчета,
			СтруктураДополнительныеСвойства.КурсДокумента,      СтруктураДополнительныеСвойства.КурсРегл,
			СтруктураДополнительныеСвойства.КратностьДокумента, СтруктураДополнительныеСвойства.КратностьРегл,,
			ДокументСсылка);
		ТекСтрока.СуммаНДСУпр = уатОбщегоНазначенияТиповые.ПересчитатьИзВалютыВВалюту(ТекСтрока.СуммаНДСУпр,
			ДокументСсылка.ВалютаДокумента,                     СтруктураДополнительныеСвойства.ВалютаУпрУчета,
			СтруктураДополнительныеСвойства.КурсДокумента,      СтруктураДополнительныеСвойства.КурсУпр,
			СтруктураДополнительныеСвойства.КратностьДокумента, СтруктураДополнительныеСвойства.КратностьУпр,,
			ДокументСсылка);
	КонецЦикла;
	
	уатРасчетыПоТарифам_уэ.РаспределитьДоходыРасходыМеждуЗаказами(ТаблицаДокумента);
	
	Если ДокументСсылка.ВидОперации = Перечисления.уатВидыОперацийПрочиеДоходыРасходы.Доходы Тогда
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаДоходы", ТаблицаДокумента);
	Иначе
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРасходы", ТаблицаДокумента);
	КонецЕсли;
	
КонецПроцедуры

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаИзносАгрегатов(ДокументСсылка, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	Расходы.ДатаОтражения КАК Период,
	|	Расходы.Ссылка.Организация КАК Организация,
	|	Расходы.Агрегат КАК СерияНоменклатуры,
	|	Расходы.ТС КАК ТС,
	|	Расходы.Сумма КАК Износ
	|ИЗ
	|	Документ.уатПрочиеДоходыРасходы.Расходы КАК Расходы
	|ГДЕ
	|	Расходы.Ссылка = &Ссылка
	|	И Расходы.Агрегат <> ЗНАЧЕНИЕ(Справочник.уатСерииНоменклатуры.ПустаяСсылка)");
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	
	мТаблицаИзносаАгрегатов = Запрос.Выполнить().Выгрузить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаИзносаАгрегатов", мТаблицаИзносаАгрегатов);
	
КонецПроцедуры // СформироватьТаблицаИзносАгрегатов()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаСпецодеждаСотрудников(ДокументСсылка, СтруктураДополнительныеСвойства)
	
	Если ДокументСсылка.Расходы.Количество() = 0 Тогда
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаСпецодеждаСотрудников", Новый ТаблицаЗначений);
		Возврат;
	КонецЕсли;
	
	Для Каждого ТекСтрокаДокумента Из ДокументСсылка.Расходы Цикл
		мЗапрос = Новый Запрос;
		мЗапрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	НЕОПРЕДЕЛЕНО КАК Период,
		|	&Ссылка КАК Регистратор,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
		|	уатСпецодеждаИИнструментыСотрудниковОстатки.Сотрудник КАК Сотрудник,
		|	уатСпецодеждаИИнструментыСотрудниковОстатки.Должность КАК Должность,
		|	уатСпецодеждаИИнструментыСотрудниковОстатки.Номенклатура КАК Номенклатура,
		|	уатСпецодеждаИИнструментыСотрудниковОстатки.ДатаВыдачи КАК ДатаВыдачи,
		|	уатСпецодеждаИИнструментыСотрудниковОстатки.СтоимостьОстаток КАК ПервоначальнаяСтоимость,
		|	уатСпецодеждаИИнструментыСотрудниковОстатки.СуммаИзносаОстаток КАК СуммаИзносаОстаток,
		|	уатСпецодеждаИИнструментыСотрудниковОстатки.СтоимостьОстаток - уатСпецодеждаИИнструментыСотрудниковОстатки.СуммаИзносаОстаток КАК СтоимостьОстаток,
		|	0 КАК СуммаИзноса
		|ИЗ
		|	РегистрНакопления.уатСпецодеждаИИнструментыСотрудников.Остатки(
		|			&МоментВремени,
		|			Сотрудник В (&мсвСотрудники)
		|				И Номенклатура В (&мсвНоменклатура)) КАК уатСпецодеждаИИнструментыСотрудниковОстатки
		|ГДЕ
		|	уатСпецодеждаИИнструментыСотрудниковОстатки.СтоимостьОстаток > 0
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатаВыдачи";
		мЗапрос.УстановитьПараметр("мсвСотрудники",   ДокументСсылка.Расходы.Выгрузить().ВыгрузитьКолонку("Сотрудник"));
		мЗапрос.УстановитьПараметр("мсвНоменклатура", ДокументСсылка.Расходы.Выгрузить().ВыгрузитьКолонку("Номенклатура"));
		мЗапрос.УстановитьПараметр("МоментВремени",   Новый Граница(ТекСтрокаДокумента.ДатаОтражения, ВидГраницы.Исключая));
		мЗапрос.УстановитьПараметр("Ссылка",          ДокументСсылка);
		
		тблИзносСпецодежды = мЗапрос.Выполнить().Выгрузить();
		
		Если НЕ ЗначениеЗаполнено(ТекСтрокаДокумента.Номенклатура)
			ИЛИ ТекСтрокаДокумента.Номенклатура.ВидНоменклатуры <> Справочники.ВидыНоменклатуры.СпецодеждаИИнструменты Тогда
			Продолжить;
		КонецЕсли;
		
		ТекСтрокаСуммаУпр = уатОбщегоНазначенияТиповые.ПересчитатьИзВалютыВВалюту(ТекСтрокаДокумента.Сумма,
			ДокументСсылка.ВалютаДокумента, СтруктураДополнительныеСвойства.ВалютаУпрУчета,
			ДокументСсылка.Дата, ДокументСсылка.Дата,,,,
			ДокументСсылка);	
		
		// расчет итоговой первоначальной стоимости для распределения износа по партиям
		ИтоговаяПервоначальнаяСтоимость = 0;
		Для Каждого ТекСтрокаРегистра Из тблИзносСпецодежды Цикл
			Если ТекСтрокаРегистра.Номенклатура <> ТекСтрокаДокумента.Номенклатура Тогда
				Продолжить;
			КонецЕсли;
			
			ИтоговаяПервоначальнаяСтоимость = ИтоговаяПервоначальнаяСтоимость + ТекСтрокаРегистра.ПервоначальнаяСтоимость;
		КонецЦикла;
		
		Если ИтоговаяПервоначальнаяСтоимость = 0 Тогда
			Продолжить;
		КонецЕсли;
					
		// Первый проход - подсчет дополнительной суммы износа, которая остается от разницы расчетного износа
		// и остаточной стоимости, если остаточная стоимость меньше расчетного износа. 
		СуммаИзносаДоп = 0;
		Для Каждого ТекСтрокаРегистра Из тблИзносСпецодежды Цикл
			Если ТекСтрокаРегистра.Номенклатура <> ТекСтрокаДокумента.Номенклатура Тогда
				Продолжить;
			КонецЕсли;
			
			ТекСуммаИзноса = ТекСтрокаСуммаУпр * ТекСтрокаРегистра.ПервоначальнаяСтоимость / ИтоговаяПервоначальнаяСтоимость;
			
			Если ТекСтрокаРегистра.СтоимостьОстаток < ТекСуммаИзноса Тогда
				ТекСтрокаРегистра.СуммаИзноса = ТекСтрокаРегистра.СтоимостьОстаток;
				СуммаИзносаДоп = СуммаИзносаДоп + (ТекСуммаИзноса - ТекСтрокаРегистра.СтоимостьОстаток);
			Иначе
				ТекСтрокаРегистра.СуммаИзноса = ТекСуммаИзноса;
			КонецЕсли;
			
			ТекСтрокаРегистра.Период = ТекСтрокаДокумента.ДатаОтражения;
		КонецЦикла;
		
		// Распределение сумма доп. износа на другие партии СО, у которых остаточная стоимость больше расчетного износа.
		Если СуммаИзносаДоп <> 0 Тогда
			Для Каждого ТекСтрокаРегистра Из тблИзносСпецодежды Цикл
				Если ТекСтрокаРегистра.Номенклатура <> ТекСтрокаДокумента.Номенклатура
					ИЛИ ТекСтрокаРегистра.СуммаИзноса = ТекСтрокаРегистра.СтоимостьОстаток Тогда
					Продолжить;
				КонецЕсли;
				
				ТекСуммаДопИзноса = Мин(СуммаИзносаДоп, ТекСтрокаРегистра.СтоимостьОстаток - ТекСтрокаРегистра.СуммаИзноса);
				ТекСтрокаРегистра.СуммаИзноса = ТекСтрокаРегистра.СуммаИзноса + ТекСуммаДопИзноса;
				
				СуммаИзносаДоп = СуммаИзносаДоп - ТекСуммаДопИзноса;
			КонецЦикла;
		КонецЕсли;
		
		// Сумма доп. износа не распределена полностью. Это значит, что общая сумма износа в строке ТЧ
		// превышает общее остаточную стоимость СО у сотрудника. Пишем в любую партию (например, последнюю),
		// всё равно контроль остатков увидит нехватку и отменит проведение
		Если СуммаИзносаДоп > 0 Тогда
			тблИзносСпецодежды[тблИзносСпецодежды.Количество()-1].СуммаИзноса =
				тблИзносСпецодежды[тблИзносСпецодежды.Количество()-1].СуммаИзноса + СуммаИзносаДоп;
		КонецЕсли;
			
		// Учет последней копейки, связанной с округлением до сотых при распределении суммы износа по партиям.
		КоличествоПартий = тблИзносСпецодежды.НайтиСтроки(Новый Структура("Номенклатура", ТекСтрокаДокумента.Номенклатура)).Количество();
		СчПартий = 0;
		СуммаИзносаПартийВсего = 0;
		Для Каждого ТекСтрокаРегистра Из тблИзносСпецодежды Цикл
			Если ТекСтрокаРегистра.Номенклатура <> ТекСтрокаДокумента.Номенклатура Тогда
				Продолжить;
			КонецЕсли;
			
			СчПартий = СчПартий + 1;
			СуммаИзносаПартийВсего = СуммаИзносаПартийВсего + ТекСтрокаРегистра.СуммаИзноса;
			
			Если СчПартий = КоличествоПартий И ТекСтрокаДокумента.Сумма <> СуммаИзносаПартийВсего Тогда
				ТекСтрокаРегистра.СуммаИзноса = ТекСтрокаРегистра.СуммаИзноса + (ТекСтрокаДокумента.Сумма - СуммаИзносаПартийВсего);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Если тблИзносСпецодежды.Количество() > 0 Тогда
		Сч = тблИзносСпецодежды.Количество()-1;
		Пока Сч >= 0 Цикл
			Если тблИзносСпецодежды[Сч].СуммаИзноса = 0 Тогда
				тблИзносСпецодежды.Удалить(Сч);
			КонецЕсли;
			Сч = Сч - 1;
		КонецЦикла;
	КонецЕсли;
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаСпецодеждаСотрудников", тблИзносСпецодежды);
	
КонецПроцедуры // СформироватьТаблицаСпецодеждаСотрудников()

#КонецОбласти
			 

#КонецЕсли
